01_mono/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version          2.0;
  format           ascii;
  class            volVectorField;
  object           U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions         [0 1 -1 0 0 0 0];

internalField      uniform (30 0 0);

boundaryField
{
  inlet
  {
    type           fixedValue;
    value          uniform (30 0 0);
  }
  outlet
  {
    type            freestreamVelocity;
    freestreamValue uniform (30 0 0);
    value           uniform (30 0 0);
  }
  top
  {
    type            freestreamVelocity;
    freestreamValue uniform (30 0 0);
    value           uniform (30 0 0);
  }
  bottom
  {
    type           movingWallVelocity;
    value          uniform (30 0 0);
  }
  left
  {
    type            freestreamVelocity;
    freestreamValue uniform (30 0 0);
    value           uniform (30 0 0);
  }
  right
  {
    type            freestreamVelocity;
    freestreamValue uniform (30 0 0);
    value           uniform (30 0 0);
  }
  monobobGroup
  {
    type           noSlip;
  }
}
