01_mono/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
  version          2.0;
  format           ascii;
  class            volScalarField;
  object           nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions         [0 2 -1 0 0 0 0];

internalField      uniform 4.5e-5;

boundaryField
{
  inlet
  {
    type           fixedValue;
    value          uniform 4.5e-5;
  }
  outlet
  {
    type           zeroGradient;
  }
  top
  {
    type           freestream;
    freestreamValue uniform 4.5e-5;
  }
  bottom
  {
    type           fixedValue;
    value          uniform 0;
  }
  left
  {
    type           freestream;
    freestreamValue uniform 4.5e-5;
  }
  right
  {
    type           freestream;
    freestreamValue uniform 4.5e-5;
  }
  monobobGroup
  {
    type           fixedValue;
    value          uniform 0;
  }
}


// ************************************************************************* //
