01_mono/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version          2.0;
  format           ascii;
  class            volScalarField;
  object           nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions         [0 2 -1 0 0 0 0];
internalField      uniform 0;

boundaryField
{
  inlet
  {
    type           calculated;
    value          uniform 0;
  }
  outlet
  {
    type           calculated;
    value          uniform 0;
  }
  top
  {
    type           calculated;
    value          uniform 0;
  }
  bottom
  {
    type           nutUSpaldingWallFunction;
    value          uniform 0;
  }
  left
  {
    type           calculated;
    value          uniform 0;
  }
  right
  {
    type           calculated;
    value          uniform 0;
  }
  monobobGroup
  {
    type           nutUSpaldingWallFunction;
    value          uniform 0;
  }
}


// ************************************************************************* //
