01_mono/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
  version          2.0;
  format           ascii;
  class            volScalarField;
  object           p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions         [0 2 -2 0 0 0 0];

internalField      uniform 0;

boundaryField
{
  inlet
  {
    type           zeroGradient;
  }
  outlet
  {
    type           fixedValue;
    value          uniform 0;
  }
  top
  {
    type            freestreamPressure;
    freestreamValue uniform 0;
  }
  bottom
  {
    type           zeroGradient;
  }
  left
  {
    type            freestreamPressure;
    freestreamValue uniform 0;
  }
  right
  {
    type            freestreamPressure;
    freestreamValue uniform 0;
  }
  monobobGroup
  {
    type           zeroGradient;
  }
}


// ************************************************************************* //

