01_mono/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version          2.0;
  format           ascii;
  class            dictionary;
  object           blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType     LES;

LES
{
  LESModel         SpalartAllmarasDDES;
  SpalartAllmarasDDESCoeffs
  {
    useSigma       true;
  }

  delta            DeltaOmegaTilde;
  DeltaOmegaTildeCoeffs
  {
  }
}
// ************************************************************************* //
