01_mono/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version          2.0;
  format           ascii;
  class            dictionary;
  object           blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale           1;
convertToMeters 1.0;

vertices
(
  (-10 -5  0.0)
  (+30 -5  0.0)
  (+30 +5  0.0)
  (-10 +5  0.0)


  (-10 -5 10.0)
  (+30 -5 10.0)
  (+30 +5 10.0)
  (-10 +5 10.0)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (40 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  inlet
  {
    type patch;
    faces
    (
      (0 4 7 3)
    );
  }
  outlet
  {
    type patch;
    faces
    (
      (2 6 5 1)
    );
  }
  top
  {
    type wall;
    faces
    (
      (4 5 6 7)
    );
  }
  bottom
  {
    type wall;
    faces
    (
      (0 3 2 1)
    );
  }
  left
  {
    type wall;
    faces
    (
      (1 5 4 0)
    );
  }
  right
  {
    type wall;
    faces
    (
      (3 7 6 2)
    );
  }
);


// ************************************************************************* //
