01_mono/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version          2.0;
  format           ascii;
  class            dictionary;
  object           controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs               (OpenFOAM fieldFunctionObjects);

application        pimpleFoam;

startFrom          latestTime;

startTime          0;

stopAt             endTime;

endTime            100;

deltaT             0.005;

writeControl       timeStep;

writeInterval      500;

purgeWrite         0;

writeFormat        ascii;

writePrecision     8;

writeCompression   on;

timeFormat         general;

timePrecision      8;

runTimeModifiable  true;

functions
{
  #include "forceCoeffs"
}


// ************************************************************************* //
