01_mono/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version          2.0;
  format           ascii;
  class            dictionary;
  object           blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forceCoeffs1
{
  type          forceCoeffs;

  libs          (forces);

  writeControl  timeStep;
  writeInterval 1;

  log           yes;

  patches       (monobobGroup);
  rho           rhoInf;
  rhoInf        1.225;
  liftDir       (0 0 1);
  dragDir       (1 0 0);
  CofR
  pitchAxis     (0 1 0);
  magUInf       30;
  lRef          2.812;
  Aref          0.4697;
}


// ************************************************************************* //
