01_mono/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version                   2.0;
  format                    ascii;
  class                     dictionary;
  object                    fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
  default         backward;
}

gradSchemes
{
  default         Gauss linear;
  grad(U)         cellLimited Gauss linear 1;
  grad(nuTilda)   cellLimited Gauss linear 1;
}

divSchemes
{
  default                       none;
  div(phi,U)                    bounded Gauss linearUpwindV grad(U);
  div(phi,nuTilda)              bounded Gauss upwind;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
  default                       Gauss linear corrected;
}

interpolationSchemes
{
  default                       linear;
}

snGradSchemes
{
  default                       corrected;
}

wallDist
{
  method                        meshWave;
}


// ************************************************************************* //
