01_mono/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  p
  {
    solver          GAMG;
    tolerance       1e-07;
    relTol          0.01;
    smoother        GaussSeidel;
  }

  pFinal
  {
    $p;
    tolerance       1e-08;
    relTol          0;
  }

  "(U|nuTilda)"
  {
    solver          smoothSolver;
    tolerance       1e-08;
    relTol          0.1;
    smoother        GaussSeidel;
  }

  "(U|nuTilda)Final"
  {
    solver          smoothSolver;
    tolerance       1e-08;
    relTol          0;
    smoother        GaussSeidel;
  }
}

PIMPLE
{
  nOuterCorrectors          2;
  nCorrectors               2;
  nNonOrthogonalCorrectors  0;
  momentumPredictor         yes;
}

relaxationFactors
{
  equations
  {
    U               0.7;
    nuTilda         0.7;
  }
}

cache
{
  grad(U);
}

// ************************************************************************* //
