01_mono/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version          2.0;
  format           ascii;
  class            dictionary;
  object           surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

monobob.stl
{
  extractionMethod     extractFromSurface;
  includedAngle        150;

  subsetFeatures
  {
      nonManifoldEdges no;
      openEdges        yes;
  }
  writeObj             yes;
}


// ************************************************************************* //
