01_mono/system/wallBoundedStreamLines
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM v2512                                  |
|  \\    /   O peration     | Case: Monobobsleights                           |
|   \\  /    A nd           | Author: Diep Thanh Phuong                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Interpolate U to create near-wall UNear
near
{
    type            nearWallFields;
    libs            (fieldFunctionObjects);

    writeControl    writeTime;
    executeControl  writeTime;

    fields
    (
        (U UNear)
    );

    patches         (monobobGroup);

    distance        0.001;
}


// Use UNear to track along wall
wallBoundedStreamLines
{
    type            wallBoundedStreamLine;
    libs            (fieldFunctionObjects);

    U               UNear;

    fields          (p U nuTilda nut UNear);

    setFormat       vtk;
    direction       forward;
    lifeTime        100;
    cloud           wallBoundedParticleTracks;

    seedSampleSet
    {
        type        patchSeed;

        patchSeedCoeffs
        {
            patches     (monobobGroup);
            axis        x;
            maxPoints   20000;
        }
    }

    interpolationScheme cellPoint;

    enabled         true;
    log             true;

    timeStart       1.0;
    timeEnd         1000;

    executeControl  writeTime;
    writeControl    writeTime;
}


// ************************************************************************* //
